0.57.2119-1/InformationRegisters/ККСНГ_Служебный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ККСНГ_Служебный</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

0.57.2119-1/InformationRegisters/ККСНГ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ККСНГ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

0.57.2119-1/CommonModules/ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает полное имя текущего пользователя ИБ
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//	Строка
//
Функция ПолучитьТекущегоПользователяИБ() Экспорт
	
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
КонецФункции // ПолучитьТекущегоПользователяИБ

// Возвращает информацию о используемой конфигурации
//
// Параметры:
//  нет
//
// Возвращаемое значение: 
//  Результат - Структура("Имя,Синоним,Версия")
//
Функция ОпределениеКонфигурации() Экспорт
	
	Результат = Новый Структура("Имя,Синоним,Версия");
	ЗаполнитьЗначенияСвойств(Результат, Метаданные);
	
	Возврат Результат;
	
КонецФункции

// Возвращает наименование основного модуля расширения
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//	Строка
//
Функция НаименованиеВерсииМодуля() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Расширения = РасширенияКонфигурации.Получить();
	Для каждого Расширение Из Расширения Цикл
		Если Расширение.Имя = "ККСНГ_Курьер" Тогда
			Возврат "Модуль ЭДО " + Расширение.Версия;	
		КонецЕсли;	
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат "";

КонецФункции

// Возвращает признак доступности роли для текущего пользователя
//
// Параметры:
//  НазваниеРоли: Строка	- название роли из метаданных
//
// Возвращаемое значение: Булево
// 
Функция РольДоступнаПользователю(НазваниеРоли) Экспорт

	Возврат РольДоступна(Метаданные.Роли[НазваниеРоли]);

КонецФункции

// Возвращает структуру текущего сеанса ИБ
//
// Возвращаемое значение: 
//	Результат - Структура - содержит следующие поля:
//		* ИмяКомпьютера - Строка
//		* ИмяПриложения - Строка
//		* НачалоСеанса - Число
//		* НомерСеанса  - Число
//		* НомерСоединения - Число
//	    * Пользователь - Строка (Пользователь.Имя текущего сеанса)
//
// Пример:
//	СтруктураСеанса = ПолучитьСтруктуруТекущегоСеансаИнформационнойБазы();
//
Функция ПолучитьСтруктуруТекущегоСеансаИнформационнойБазы() Экспорт
	
   Результат = Новый Структура("ИмяКомпьютера,ИмяПриложения,НачалоСеанса,НомерСеанса,НомерСоединения,Пользователь");
   ТекущийСеанс = ПолучитьТекущийСеансИнформационнойБазы();
   
   ЗаполнитьЗначенияСвойств(Результат, ТекущийСеанс, , "Пользователь");
   
   Если Не ТекущийСеанс = Неопределено Тогда
	   Результат.Пользователь = ТекущийСеанс.Пользователь.Имя;
   КонецЕсли; 
   
   Возврат Результат;
   
КонецФункции // ПолучитьТекущегоПользователяИБ

// Проверяет наличие объекта в конфигурации по наименованию
//
// Параметры:
//  Класс     - Строка - Тип объекта
//  Название  - Строка - Наименование объекта
//
// Возвращаемое значение:
//	Булево
//
Функция ОбъектМетаданныхЕстьВКонфигурации(Класс, Название) Экспорт
	
	Если Метаданные.НайтиПоПолномуИмени(Класс + "." + Название) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

// Возвращает признак тестового режима
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//	Булево
//
Функция ТестовыйРежим() Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Служебный.ТестовыйРежим(); 
	
КонецФункции

// Возвращает признак режима обновления модулей
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//	Булево
//
Функция ОбновлятьПодключаемыеМодули() Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Служебный.ОбновлятьПодключаемыеМодули(); 
	
КонецФункции

// Возвращает доступность использования устаревших форматов электронных документов
// 
// Возвращаемое значение:
//  Булево - доступность использования устаревших форматов
//
Функция УстаревшиеФорматыЭлектронныхДокументовРазрешены() Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Служебный.УстаревшиеФорматыЭлектронныхДокументовРазрешены(); 
	
КонецФункции

// Получает строковые значения идентификаторов указанного перечисления
//
// Параметры:
//  ИмяПеречисления	 - Строка	 - имя перечисления, для которого надо получить список идентификаторов
// 
// Возвращаемое значение:
//  Соответствие - список идентификаторов перечисления: ключ - ПеречисленияСсылка, значение - строковое имя
//
Функция ПолучитьЗначенияПеречисления(ИмяПеречисления) Экспорт
	
	Перем Результат, МетаданныеПеречисления;
	
	Результат = Новый Соответствие;
	
	МетаданныеПеречисления = Метаданные.Перечисления.Найти(ИмяПеречисления);
	Если Перечисления <> Неопределено Тогда
		Для каждого ЗначениеПеречисления Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
			Результат.Вставить(Перечисления[ИмяПеречисления][ЗначениеПеречисления.Имя], ЗначениеПеречисления.Имя);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область НастройкиРасширенногоЭкспорта

// Возвращает текущий режим каталог выгрузки архивов документов при расширенном экспорте.
//
// Возвращаемое значение:
//   - Строка - Текущий каталог выгрузки архивов документов при расширенном экспорте.
//   
Функция КаталогВыгрузкиРасширенногоЭкспорта() Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Настройки.КаталогВыгрузкиРасширенногоЭкспорта();
	
КонецФункции

// Возвращает текущий вариант группировки архивов документов при расширенном экспорте.
//
// Возвращаемое значение:
//   - Строка - Текущий вариант группировки (см. ПоддерживаемыеГруппировкиРасширенногоЭкспорта()).
//   
Функция ГруппировкаРасширенногоЭкспорта() Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Настройки.ГруппировкаРасширенногоЭкспорта();
	
КонецФункции

// Возвращает текущий список типов документов при расширенном экспорте.
//     ВернутьИзСохраненнойНастройки - Булево - вернуть значение из регистра если существует
//
// Возвращаемое значение:
//   - СписокЗначений - Текущий список типов документов (см. ПоддерживаемыеТипыДокументовРасширенногоЭкспорта()).
//   
Функция ТипыДокументовРасширенногоЭкспорта(ВернутьИзСохраненнойНастройки = Истина) Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Настройки.ТипыДокументовРасширенногоЭкспорта(ВернутьИзСохраненнойНастройки);
	
КонецФункции

// Возвращает краткое представление типа документа
//
// 	ПолноеПредставление - Строка:
//   			"УПД:Первичный документ" - УПД ДОП;
//   			"УПД:Счет-фактура" - УПД СЧФ;
//   			"УПД:Счет-фактура и первичный документ" - УПД СЧФДОП;
//   			"УКД:Первичный документ" - УКД ДОП;
//   			"УКД:Корректировочный счет-фактура" - УКД КСЧФ;
//   			"УКД:Корректировочный счет-фактура и первичный документ" - УКД КСЧФДОП;
// Возвращаемое значение: Строка
//   			пустая строка либо одно из "UPD_DOP"/"UPD_SF"/"UPD_SF_DOP"/"UCD_DIC"/"UCD_CSF"/"UCD_CSF_DIC"
//   
Функция КраткоеПредставлениеТипаДокумента(ПолноеПредставление) Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Настройки.КраткоеПредставлениеТипаДокумента(ПолноеПредставление);
	
КонецФункции

// Возвращает полное представление типа документа
//
// КраткоеПредставление: Строка
//   			"UPD_DOP"/"UPD_SF"/"UPD_SF_DOP"/"UCD_DIC"/"UCD_CSF"/"UCD_CSF_DIC"
//
// 	Возвращаемое значение: Строка
//   			"УПД:Первичный документ" - УПД ДОП;
//   			"УПД:Счет-фактура" - УПД СЧФ;
//   			"УПД:Счет-фактура и первичный документ" - УПД СЧФДОП;
//   			"УКД:Первичный документ" - УКД ДОП;
//   			"УКД:Корректировочный счет-фактура" - УКД КСЧФ;
//   			"УКД:Корректировочный счет-фактура и первичный документ" - УКД КСЧФДОП;
//  
Функция ПолноеПредставлениеТипаДокумента(КраткоеПредставление) Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Настройки.ПолноеПредставлениеТипаДокумента(КраткоеПредставление);
	
КонецФункции

// Возвращает сокращенное представление типа документа.
//
// 	Возвращаемое значение: 
//		Строка - Сокращенное представление типа документа.
//
//	Пример: СокращенноеПредставлениеТипаДокумента(UPD_SF) ==> "УПД.СЧФ"
//  
Функция СокращенноеПредставлениеТипаДокумента(ТипДокумента) Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Настройки.СокращенноеПредставлениеТипаДокумента(ТипДокумента);
	
КонецФункции

// Возвращает признак наличия реквизита НаименованиеПолное у справочника Контрагенты
//
// 	Возвращаемое значение: 
//		Булево 
//  
Функция УКонтрагентаЕстьРеквизитНаименованиеПолное() Экспорт

	РеквизитПоиска = Метаданные.Справочники.Контрагенты.Реквизиты.Найти("НаименованиеПолное");
	
	Возврат РеквизитПоиска <> Неопределено;

КонецФункции

// Настройки расширенного экспорта
#КонецОбласти

#Область НастройкиРасширеннойОтправкиДокументов

// Возвращает текущее значение настройки использования незавизимой отправки черновика при расширенной отправке ДО.
//
// Возвращаемое значение:
//   - Булево - текущее значение настройки.
//   
Функция ИспользуетсяОтправкаЧерновиков() Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Настройки.ИспользуетсяОтправкаЧерновиков();
	
КонецФункции

// Возвращает текущее значение настройки использования режима работы по бизнес-процессу УВХД.
//
// Возвращаемое значение:
//   - Булево - текущее значение настройки.
//   
Функция ИспользуетсяБизнесПроцессУВХД() Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Настройки.ИспользуетсяБизнесПроцессУВХД();
	
КонецФункции

#КонецОбласти

#Область ФорматыЭД

// Получает таблицу описания форматов ЭД
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//	Таблица значений
//   * ВерсияФормата           - Строка
//   * Документ                - Строка
//   * Идентификатор           - Строка
//   * Использование           - Булево
//   * КодТипаДокумента        - Строка
//   * НаименованиеВарианта    - Строка
//   * ПриказОВведенииФормата  - Строка
//   * ПространствоИмен        - Строка
//   * ТребуетсяПодпись        - Булево
//   * ФункцияУПД              - Строка
//
Функция ПолучитьФорматыЭлектронныхДокументов() Экспорт
	
	Перем Макет, ТаблицаФорматов, СтрокаФорматов;
	Перем ТекущаяДата, СтрокиКУдалению;
	
	Макет = ПолучитьОбщийМакет("ККСНГ_ФорматыЭлектронныхДокументов");
	ТаблицаФорматов = ПолучитьТаблицуЗначенийИзМакета(Макет);
	
	Если Не УстаревшиеФорматыЭлектронныхДокументовРазрешены() Тогда
		
		ТекущаяДата = ТекущаяДатаСеанса();
		СтрокиКУдалению = Новый Массив;
		
		Для каждого СтрокаФорматов Из ТаблицаФорматов Цикл
			Если ЗначениеЗаполнено(СтрокаФорматов.ДействуетДо) И ТекущаяДата > КонецДня(СтрокаФорматов.ДействуетДо) Тогда
				СтрокиКУдалению.Добавить(СтрокаФорматов);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаФорматов Из СтрокиКУдалению Цикл
			ТаблицаФорматов.Удалить(СтрокаФорматов);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаФорматов;
	
КонецФункции

// Возвращает наименования вариантов настройки документооборота.
// Сведения задаются в макете ОбщиеМакеты.ККСНГ_ФорматыЭлектронныхДокументов.
// 
// Параметры:
//  ИдентификаторыФорматов - Строка - Идентификаторы искомых форматов через запятую, например, "УКД_501, УКД_502".
//		Если параметр указан, то возвращаются только варианты настройки, содержащие переданные форматы.
//
// Возвращаемое значение:
//  Массив - наименования вариантов настройки документооборота.
//
Функция ПолучитьВариантыФорматовЭлектронныхДокументов(ИдентификаторыФорматов = "") Экспорт
	
	ТаблицаФорматов = ПолучитьФорматыЭлектронныхДокументов();
	
	Если ЗначениеЗаполнено(ИдентификаторыФорматов) Тогда
		МассивИдентификаторов = СтрРазделить(ИдентификаторыФорматов, ",", Ложь);
		ТаблицаВариантов = Неопределено;
		Для Каждого ТекИдентификатор Из МассивИдентификаторов Цикл
			ТекИдентификатор = СокрЛП(ТекИдентификатор);
			ОтборПоФормату = Новый Структура;
			ОтборПоФормату.Вставить("Идентификатор", ТекИдентификатор);
			ТекТаблицаВариантов = ТаблицаФорматов.Скопировать(ОтборПоФормату, "НаименованиеВарианта");
			Если ТаблицаВариантов = Неопределено Тогда
				ТаблицаВариантов = ТекТаблицаВариантов;
			Иначе
				ККСНГ_ОбщегоНазначенияВызовСервера.ДополнитьТаблицу(ТекТаблицаВариантов, ТаблицаВариантов);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТаблицаВариантов = ТаблицаФорматов.Скопировать(, "НаименованиеВарианта");
	КонецЕсли;
	ТаблицаВариантов.Свернуть("НаименованиеВарианта");
		
	Возврат ТаблицаВариантов.ВыгрузитьКолонку("НаименованиеВарианта");
	
КонецФункции

// Подбирает формат электронного документа из доступных на основе переданного
//
// Параметры:
//  НаименованиеВарианта - Строка	 - сиходный вариант настройки формата
// 
// Возвращаемое значение:
//  Строка - подобранный вариант
//
Функция ПолучитьДоступныйФорматЭлектронногоДокумента(НаименованиеВарианта) Экспорт
	
	Перем Результат;
	
	Результат = НаименованиеВарианта;
	
	ВариантыФорматов = ПолучитьВариантыФорматовЭлектронныхДокументов();
	Если ВариантыФорматов.Найти(НаименованиеВарианта) = Неопределено Тогда
		Для каждого ВариантФормата Из ВариантыФорматов Цикл
			
			Если Результат = НаименованиеВарианта Тогда
				Результат = ВариантФормата; // первый из доступных по-умолчанию
			КонецЕсли;
			
			Если СтрНайти(НаименованиеВарианта, "для каждого документа") > 0 И СтрНайти(ВариантФормата, "для каждого документа") > 0 Тогда
				Результат = ВариантФормата;
				Прервать;
			КонецЕсли;
			
			Если СтрНайти(НаименованиеВарианта, "для комплекта") > 0 И СтрНайти(ВариантФормата, "для комплекта") > 0 Тогда
				Результат = ВариантФормата;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру с настройками формата ЭД.
// 
// Возвращаемое значение:
//  Структура - состав указан в макете ККСНГ_ФорматыЭлектронныхДокументов.
//
Функция ПолучитьФорматЭлектронногоДокумента(НаименованиеВарианта, Документ, Использование = Истина) Экспорт
	
	Перем Результат, ТаблицаФорматов, ВариантФормата;
	Перем Отбор, НайденныеСтроки, НайденнаяСтрока, ИмяКолонки;
	
	Результат = Неопределено;
	
	ВариантФормата = ПолучитьДоступныйФорматЭлектронногоДокумента(НаименованиеВарианта);
	ТаблицаФорматов = ПолучитьФорматыЭлектронныхДокументов();
	
	Отбор = Новый Структура();
	Отбор.Вставить("НаименованиеВарианта", ВариантФормата);
	Отбор.Вставить("Документ", Документ);
	Отбор.Вставить("Использование", Использование);
	НайденныеСтроки = ТаблицаФорматов.НайтиСтроки(Отбор);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		Результат = Новый Структура;
		Для Каждого Колонка Из ТаблицаФорматов.Колонки Цикл
			ИмяКолонки = Колонка.Имя;
			Результат.Вставить(ИмяКолонки, НайденнаяСтрока[ИмяКолонки]);
		КонецЦикла;
		
		Прервать;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Формирует таблицу значений из мактета.
// Сведения задаются в макете ККСНГ_ФорматыЭлектронныхДокументов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - состав и типы колонок указаны в макете ККСНГ_ФорматыЭлектронныхДокументов.
//
Функция ПолучитьТаблицуЗначенийИзМакета(Макет) Экспорт

	Результат = Новый ТаблицаЗначений;
	
	ОбрабатываемыеСсылочныеТипы = Новый Массив;
	//ОбрабатываемыеСсылочныеТипы.Добавить("Перечисления");
	//ОбрабатываемыеСсылочныеТипы.Добавить("ПланыВидовХарактеристик");
	//ОбрабатываемыеСсылочныеТипы.Добавить("Справочники");
	
	// Получим колонки таблицы форматов
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	Для Сч = 1 По ОбластьШапки.ШиринаТаблицы Цикл
		ИмяКолонки = ОбластьШапки.Область(1, Сч).Текст;
		Если ЗначениеЗаполнено(ИмяКолонки) Тогда
			ПредставлениеТипаКолонки = ОбластьШапки.Область(2, Сч).Текст;
			ТипКолонки = Новый ОписаниеТипов(ПредставлениеТипаКолонки);
			
			Результат.Колонки.Добавить(ИмяКолонки, ТипКолонки);
		КонецЕсли;
	КонецЦикла;
	
	// Заполним строки
	ОбластьСтрок = Макет.ПолучитьОбласть("Строки");
	Для НомерСтроки = 1 По ОбластьСтрок.ВысотаТаблицы Цикл
		Если ЗначениеЗаполнено(ОбластьСтрок.Область(НомерСтроки, 1).Текст) Тогда
			НоваяСтрока = Результат.Добавить();
			
			Для НомерКолонки = 1 По Результат.Колонки.Количество() Цикл
				Колонка = Результат.Колонки[НомерКолонки - 1];
				
				ТекстЯчейки = СокрЛП(ОбластьСтрок.Область(НомерСтроки, НомерКолонки).Текст);
				ТипЗначения = Колонка.ТипЗначения.Типы()[0];
				
				ПолноеИмяОбъекта = "";
				ЗначениеЯчейкиОтвет = ЗначениеЯчейки(ТипЗначения, ТекстЯчейки, ОбрабатываемыеСсылочныеТипы, Колонка, ПолноеИмяОбъекта);
				Если НЕ ЗначениеЯчейкиОтвет.Успех Тогда
					ШаблонОшибки = НСтр("ru='В макете %1 использован неподдерживаемый ссылочный тип (%2)'");
					СтрокаОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, 
					Метаданные.ОбщиеМакеты.ККСНГ_ФорматыЭлектронныхДокументов.Синоним, ПолноеИмяОбъекта);
					ВызватьИсключение СтрокаОшибки;					
				КонецЕсли;
				
				НоваяСтрока[Колонка.Имя] = ЗначениеЯчейкиОтвет.Результат;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;       
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область НастройкиПроксиСервера

// Возвращает текущие настройки прокси-сервера
//
// 	Возвращаемое значение: 
//		Соответствие 
//  
Функция НастройкиПроксиСервера() Экспорт
	
	Возврат РегистрыСведений.ККСНГ_Настройки.НастройкиПроксиСервера();
	
КонецФункции

#КонецОбласти

// Возвращает структуру с ключами, аналогичными полям указанного типа XDTO
//
// Параметры:
//	ТипXDTO - строка с именем типа или тип объекта XDTO
//	ПространствоИмен - пространство имен
//
// Возвращаемое значение:
//	Структура
//
// Пример:
//	СтруктураДокумента = ПолучитьСтруктуруПоТипуXDTO("type_Document", "http://schemas.datacontract.org/2004/07/Korus.Eds.Api");
//
Функция ПолучитьСтруктуруПоТипуXDTO(ТипXDTO, ПространствоИмен) Экспорт
	
	Возврат ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO(ТипXDTO, ПространствоИмен);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеЯчейки(ТипЗначения, ТекстЯчейки, ОбрабатываемыеСсылочныеТипы, Колонка, ПолноеИмяОбъекта)

	Ответ = Новый Структура;
	Ответ.Вставить("Успех",     Истина);
	Ответ.Вставить("Результат", Неопределено);
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗначения);
		ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
		ИмяБазовогоТипа = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(МетаданныеОбъекта);
		Если ОбрабатываемыеСсылочныеТипы.Найти(ИмяБазовогоТипа) <> Неопределено Тогда
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
			Ответ.Результат = МенеджерОбъекта[ТекстЯчейки];
		Иначе
			Ответ.Успех = Ложь;
		КонецЕсли;
	Иначе
		Если ТипЗначения = Тип("Дата") И ЗначениеЗаполнено(ТекстЯчейки) Тогда
			Ответ.Результат = ККСНГ_ОбщегоНазначенияКлиентСервер.ДатаИзСтроки(ТекстЯчейки);
		ИначеЕсли ТипЗначения = Тип("Массив") И ЗначениеЗаполнено(ТекстЯчейки) Тогда
			Ответ.Результат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстЯчейки, ",", Истина, Истина);
		Иначе
			Ответ.Результат = Колонка.ТипЗначения.ПривестиЗначение(ТекстЯчейки);
		КонецЕсли;
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

#КонецОбласти
